// Завдання 1. Лічильник подій
// Створіть функцію, яка рахує, скільки елементів масиву відповідають певній умові, використовуючи колбек-функцію для перевірки.
// Створіть функцію countItems(array, condition)
// Створіть змінну count = 0
// Пройдіться по масиву циклом for...of
// Для кожного елемента викличте condition(element)
// Якщо condition повертає true, збільште count на 1
// Поверніть кінцевий результат

const numbers = [1, 5, 8, 12, 3, 15, 7, 20];
const words = ["кіт", "собака", "миша", "папуга", "хомяк"];

function countItems(array, condition) {
  let count = 0;

  for (const element of array) {
    if (condition(element)) {
      count++;
    }
  }

  return count;
}

// Умови для перевірки:
const isEven = (num) => num % 2 === 0;
const isLarge = (num) => num > 10;
const isShort = (word) => word.length <= 3;

// Тестування
console.log("Парних чисел:", countItems(numbers, isEven)); // 3
console.log("Чисел більше 10:", countItems(numbers, isLarge)); // 3
console.log("Коротких слів:", countItems(words, isShort)); // 1

// Завдання 2: Калькулятор з операціями
// Створіть універсальний калькулятор, який може виконувати різні математичні операції залежно від переданої колбек-функції.
// Створіть стрілкову функцію calculate(a, b, operation)
// Функція повинна викликати operation(a, b) та повернути результат
// Створіть 4 стрілкові функції для операцій: add, subtract, multiply, divide
// У функції divide додайте перевірку на ділення на нуль
// Протестуйте всі операції
const calculate = (a, b, operation) => {
  return operation(a, b);
};
const add = (a, b) => a + b;
const subtract = (a, b) => a - b;
const multiply = (a, b) => a * b;
const divide = (a, b) => {
  if (a === 0 || b === 0) {
    alert("Error: Ділення на нуль заборонено");
  }
  return a / b;
};

console.log(calculate(10, 5, add));
console.log(calculate(10, 5, subtract));
console.log(calculate(10, 5, multiply));
console.log(calculate(10, 5, divide));
console.log(calculate(10, 0, divide));

// Завдання 3: Генератор повідомлень
// Створіть функцію, яка повторює певну дію задану кількість разів, використовуючи колбек-функцію для генерації повідомлень.
// Створіть функцію repeatMessage(times, messageCreator)
// Створіть цикл for від i = 0 до i < times
// На кожній ітерації викликайте messageCreator(i)
// Протестуйте з різними колбеками
function repeatMessage(times, messageCreator) {
  for (let i = 0; i < times; i++) {
    messageCreator(i);
  }
}
function simpleMessage(i) {
  console.log("Повідомлення №" + i);
}
function numberedMessage(i) {
  console.log("Це повідомлення з індексом: " + i);
}
function emojiMessage(i) {
  console.log("🔥 Повтор " + (i + 10));
}

// Тестування

repeatMessage(3, simpleMessage);

repeatMessage(2, numberedMessage);

repeatMessage(4, emojiMessage);
